# ExportLayerKey Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLayerKey Constructor
ExportLayerKey Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportLayerKey()()()() | Constructs a new ExportLayerKey with default values. |
| ExportLayerKey(String, String, SpecialType) | Constructs a new ExportLayerKey with categoryName, subCategoryName and a special type. |

# See Also
ExportLayerKey Class
ExportLayerKey Members
Autodesk.Revit.DB Namespace